# rubocop:disable all

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "universal-ctags/universal-ctags"
tap "ikuwow/ikuwow-sshrc"
tap "domt4/autoupdate"

brew "mas"
brew "mackup"

# First required
mas "Things3", id: 904280696
mas "Bear", id: 1091189122
mas "1Password 7", id: 1333542190
mas "WiFi Signal", id: 525912054
cask "google-chrome"
cask "karabiner-elements"
cask "authy"
cask "iterm2"
cask "pastebot"
cask "istat-menus"
cask "rescuetime"
cask "ferdi"
cask "vanilla"
cask "adguard"
brew "bash"

brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-which"
brew "gawk"
brew "grep"

# required by denite.nvim etc.
brew "python"
brew "ruby"

# For AWS
brew "awscli"
brew "awslogs"
cask "session-manager-plugin", args: {"no-quarantine": ""}

brew "zlib"
brew "asdf"
brew "openssl"
brew "telnet"
brew "bash-completion@2"
brew "docker-compose-completion"
brew "docker-machine-completion"
brew "cloog"
brew "gcc"
brew "ghostscript"
brew "git"
brew "git-secrets"
brew "highlight"
brew "jq"
brew "nkf"
brew "nmap"
brew "pwgen"
brew "ikuwow/ikuwow-sshrc/sshrc"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "watch"
brew "fontforge"
brew "neovim"
brew "graphviz"
brew "universal-ctags", args: ["HEAD"]
brew "shellcheck"
brew "slackcat"
brew "circleci"
brew "masutaka/github-nippou/github-nippou"
brew "gpg"
brew "sqlparse"
brew "imagemagick"
brew "thefuck"
brew "shfmt"
brew "ccat"
brew "ghq"
brew "fzf"
brew "percona-toolkit"
brew "noti"
brew "terminal-notifier"
brew "postgresql"
brew "mysql"
brew "pre-commit"
brew "act"

# For PHP
brew "libsodium"
brew "bison"
brew "re2c"
brew "libiconv"
brew "libzip"

cask "docker"
cask "vimr"
cask "xquartz"
cask "firefox"
cask "google-cloud-sdk"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "zoom"
cask "chromedriver"

mas "Dark Reader for Safari", id: 1438243180
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 1384080005
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Save to Pocket", id: 1477385213
mas "Day One", id: 1055511498
mas "Habitify", id: 1140787122
mas "Valentina Studio", id: 604825918
mas "Spark", id: 1176895641
mas "New File Menu", id: 1064959555
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "WaterMinder", id: 1415257369
mas "Simplified for Twitter", id: 1479307973
