# rubocop:disable all

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/autoupdate"
tap "universal-ctags/universal-ctags"
tap "ikuwow/ikuwow-sshrc"
tap "minamijoyo/tfmigrate"

brew "mas"
brew "mackup"

# First required
mas "Things3", id: 904280696
mas "Bear", id: 1091189122
cask "1password"
mas "1Password for Safari", id: 1569813296
mas "WiFi Signal", id: 525912054
cask "karabiner-elements"
cask "authy"
cask "iterm2"
cask "pastebot"
cask "istat-menus"
cask "rambox"
cask "vanilla"
cask "adguard"
mas "nordvpn", id: 905953485
brew "bash"
cask "atok"
cask "logi-options-plus"
# This installation process hangs up!
# Install by yourself from: https://www.logitechg.com/en-us/innovation/g-hub.html
# cask "logitech-g-hub"
cask "jetbrains-toolbox"

brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-which"
brew "gawk"
brew "grep"

# required by vim
brew "python"
brew "node@16"

# For AWS
brew "awscli"
brew "awslogs"
brew "cfn-lint"
cask "session-manager-plugin"

brew "zlib"
brew "asdf"
brew "openssl"
brew "telnet"
brew "bash-completion@2"
brew "cloog"
brew "gcc"
brew "ghostscript"
brew "git"
brew "git-secrets"
brew "highlight"
brew "jq"
brew "nkf"
brew "nmap"
brew "pwgen"
brew "ikuwow/ikuwow-sshrc/sshrc"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "watch"
brew "fontforge"
brew "neovim"
brew "graphviz"
brew "universal-ctags"
brew "shellcheck"
brew "slackcat"
brew "circleci"
brew "actionlint"
brew "yamllint"
brew "sqlparse"
brew "imagemagick"
brew "thefuck"
brew "shfmt"
brew "ccat"
brew "ghq"
brew "fzf"
brew "percona-toolkit"
brew "noti"
brew "postgresql@14"
brew "mysql"
brew "pre-commit"
brew "act"
brew "tfmigrate"
brew "tflint"
brew "python-yq" # Not "yq"
brew "gh"
brew "kafka"
brew "akamai"

# For gpg key
brew "gpg"
cask "gpg-suite-no-mail"

# For PHP
brew "libsodium"
brew "bison"
brew "re2c"
brew "libiconv"
brew "libzip"

# k8s
brew "kubie"
brew "k9s"
cask "lens"
brew "minikube"
brew "kind"
brew "fluxcd/tap/flux@0.41"
# kubectl and kustomize should be managed by asdf

if RUBY_PLATFORM.include?('x86_64')
  cask "intel-power-gadget"
end

# Browsers
cask "google-chrome"
cask "microsoft-edge"
cask "firefox"

cask "docker" # homebrew/cask/docker
cask "finch"
cask "vimr"
cask "xquartz"
cask "google-cloud-sdk"
cask "vagrant"
cask "vlc"
cask "zoom"
cask "chromedriver"
cask "lastfm"
cask "ears"
cask "krisp"
cask "mysqlworkbench"
cask "powershell"
cask "onyx"

mas "Dark Reader for Safari", id: 1438243180
mas "The Unarchiver", id: 425424353
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Instapaper Save", id: 1481302432
mas "Day One", id: 1055511498
mas "Spark", id: 1176895641
mas "New File Menu", id: 1064959555
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "WaterMinder", id: 1415257369
mas "EasyRes", id: 688211836
mas "Streaks", id: 963034692
mas "Speedtest", id: 1153157709
mas "Tweaks for Twitter", id: 1567751529
mas "one sec", id: 1532875441
